Управление_торговлей_115_демо_.Teklifo/src/Enums/TK_ТипыЗапроса/TK_ТипыЗапроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TK_ТипыЗапроса</name>
  <enumValues>
    <name>Публичный</name>
  </enumValues>
  <enumValues>
    <name>Закрытый</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_115_демо_.Teklifo/src/Enums/КомпанияЧастноеЛицо/КомпанияЧастноеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="552f0508-9b80-4fec-9ba5-fcd38569861a">
  <name>КомпанияЧастноеЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="af9cb34d-d5ea-4de1-a7d6-999e6bd67541">
    <name>Компания</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_115_демо_.Teklifo/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e9878089-011c-4608-902f-a358fcc73d96">
  <name>ЮрФизЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1312f787-af91-4e9f-bb79-f968d50d327d">
    <name>ЮрЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_115_демо_.Teklifo/src/Documents/TK_ЗапросЦенОтКлиента/TK_ЗапросЦенОтКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TK_ЗапросЦенОтКлиента</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДатаСбораПредложения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДатаСбораПредложения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКУсловиямДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКУсловиямОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапроса</name>
    <type>
      <types>EnumRef.TK_ТипыЗапроса</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЖелаемаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей_115_демо_.Teklifo/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4259c461-12b1-4f3e-8283-5927c75afdb6">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="489feb46-8450-495a-ab9b-547fdd55c2bc">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>TK_ИдентификаторTeklifo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="ce59e7d4-ce32-4e73-8b06-cda594aec2b3">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="be19691e-3e4a-44a7-96c2-ce843902e27e">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56ba8e3c-152e-472e-978c-1c8a27110815">
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Управление_торговлей_115_демо_.Teklifo/src/CommonModules/TK_ЗагрузкаИСозданиеДанныхСервер/Module.bsl
// Загрузить документ запрос цен от клиента.
// 
// Параметры:
//  ДанныеЗагрузки - Структура - Загрузить документ запрос цен от клиента:
// * versionId 
// * id 
// * externalId 
// * number 
// * companyId 
// * privateRequest 
// * userId 
// * title 
// * currency 
// * startDate 
// * endDate 
// * description 
// * deliveryAddress 
// * deliveryTerms 
// * paymentTerms 
// * createdAt 
// * latestVersion 
// * deleted 
// * company - Структура - :
// ** id 
// ** name 
// ** tin 
// ** description 
// ** descriptionRu 
// ** slogan 
// ** sloganRu 
// ** createdAt 
// ** updatedAt 
// ** deleted 
// * items - Массив из Структура - 
// * participants - Массив из Структура - Данные загрузки
//  Организация - СправочникСсылка.Организации - Организация
// 
// Возвращаемое значение:
//  Структура - Загрузить документ запрос цен от клиента:
// * ДокЗапроса - ДокументСсылка.TK_ЗапросЦенОтКлиента - 
// * id 
// * number 
// * latestVersion 
// * versionId
Функция ЗагрузитьДокументЗапросЦенОтКлиента(ДанныеЗагрузки,Организация) Экспорт
	
	ДанныеНайденногоДокумента = TK_ОбщегоНазначенияСервер.ПолучитьДанныеДокументаЗапросаЦенОтКлиентаПоВнешнемуID(ДанныеЗагрузки.versionId);
	
	ДокументЗапросЦен = ДанныеНайденногоДокумента.ДокументЗапроса;
	
	Если Не ЗначениеЗаполнено(ДокументЗапросЦен) Тогда
      ДокументЗапросЦенОбъект = Документы.TK_ЗапросЦенОтКлиента.СоздатьДокумент();	
	Иначе
      ДокументЗапросЦенОбъект = ДокументЗапросЦен.ПолучитьОбъект();		
	КонецЕсли;
	
	ДокументЗапросЦенОбъект.Дата = ДанныеЗагрузки.createdAt;
	ДокументЗапросЦенОбъект.Организация = Организация;
	ДокументЗапросЦенОбъект.Валюта      = Справочники.Валюты.НайтиПоНаименованию(ДанныеЗагрузки.currency, Истина);
	Если ДанныеЗагрузки.privateRequest Тогда
      ДокументЗапросЦенОбъект.ТипЗапроса = Перечисления.TK_ТипыЗапроса.Закрытый;
	Иначе
      ДокументЗапросЦенОбъект.ТипЗапроса = Перечисления.TK_ТипыЗапроса.Публичный;		  		
	КонецЕсли;
	
	ДокументЗапросЦенОбъект.НачальнаяДатаСбораПредложения = ДанныеЗагрузки.startDate;
	ДокументЗапросЦенОбъект.КонечнаяДатаСбораПредложения  = ДанныеЗагрузки.endDate;
	ДокументЗапросЦенОбъект.ТекстовоеОписание             = ДанныеЗагрузки.description;
	ДокументЗапросЦенОбъект.АдресДоставки                 = ДанныеЗагрузки.deliveryAddress;
	ДокументЗапросЦенОбъект.КомментарийКУсловиямДоставки  = ДанныеЗагрузки.deliveryTerms;
	ДокументЗапросЦенОбъект.КомментарийКУсловиямОплаты    = ДанныеЗагрузки.paymentTerms;
	
	ДокументЗапросЦенОбъект.Партнер = СоздатьПартнера(ДанныеЗагрузки.company.tin,ДанныеЗагрузки.company.id ,
	ДанныеЗагрузки.company.name ,Ложь,Истина);
	
	Для Каждого СтрокаТоваров Из ДанныеЗагрузки.items Цикл
		ДанныеПозиции = ПолучитьСтрокуПозиции(СтрокаТоваров);	
	КонецЦикла;
	
	
	Для Каждого СтрокаУчастника Из ДанныеЗагрузки.participants Цикл
		ДанныеУчастника = ПолучитьДанныеУчастника(СтрокаУчастника);	
	КонецЦикла;
	
	ДокументЗапросЦенОбъект.Записать();
	
	
	
	СтруктураОтвета = Новый Структура("ДокЗапроса,id,number,latestVersion,versionId",ДокументЗапросЦенОбъект.Ссылка,ДанныеЗагрузки.id,
	ДанныеЗагрузки.number,ДанныеЗагрузки.latestVersion,ДанныеЗагрузки.versionId);
	
	
	Возврат СтруктураОтвета;
	
КонецФункции



Функция СоздатьПартнера(ИНН,id, НаименованиеКонтрагента, ЭтоПоставщик = Ложь, ЭтоКлиент = Ложь)
    
    СсылкаПартнера = Справочники.Партнеры.НайтиПоРеквизиту("TK_IdПартнера", СокрЛП(id));
    
    Если ЗначениеЗаполнено(СсылкаПартнера) Тогда
    	Возврат СсылкаПартнера;
    КонецЕсли;
    
    ПартнерОбъект = Справочники.Партнеры.СоздатьЭлемент();
    ПартнерОбъект.Наименование = НаименованиеКонтрагента;
    ПартнерОбъект.НаименованиеПолное = НаименованиеКонтрагента;
    ПартнерОбъект.TK_IdПартнера = СокрЛП(id);
    ПартнерОбъект.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания;
    ПартнерОбъект.Поставщик = ЭтоПоставщик;
    ПартнерОбъект.Клиент = ЭтоКлиент;
    ПартнерОбъект.Записать();
    СсылкаПартнера = ПартнерОбъект.Ссылка;
        
    КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
    КонтрагентОбъект.Наименование = НаименованиеКонтрагента;
    КонтрагентОбъект.НаименованиеПолное = НаименованиеКонтрагента;    
    КонтрагентОбъект.ИНН = ИНН;
    КонтрагентОбъект.Партнер = СсылкаПартнера;
    КонтрагентОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
    КонтрагентОбъект.Записать();
    
    Возврат СсылкаПартнера;
    
КонецФункции



// Получить данные участника.
// 
// Параметры:
//  СтрокаУчастника - Структура - Строка участника
// 
// Возвращаемое значение:
//  Структура - Получить данные участника:
// * requestForQuotationId 
// * companyId 
Функция ПолучитьДанныеУчастника(СтрокаУчастника)
	Возврат СтрокаУчастника;
КонецФункции



// Получить строку позиции.
// 
// Параметры:
//  СтрокиТоваров - Структура - Строки товаров
// 
// Возвращаемое значение:
//  Структура - Получить строку позиций:
// * versionId 
// * id 
// * externalId 
// * requestForQuotationId 
// * productId 
// * comment 
// * quantity 
// * price 
// * deliveryDate 
// * product - Структура - :
// ** id 
// ** externalId 
// ** productId 
// ** characteristicId 
// ** name 
// ** number 
// ** brand 
// ** brandNumber 
// ** unit 
// ** description 
// ** archive 
// ** companyId 
// ** createdAt 
// ** updatedAt 
// ** deleted 
Функция ПолучитьСтрокуПозиции(СтрокиТоваров)
	Возврат СтрокиТоваров;
КонецФункции
